---
kind: method
id: M:Autodesk.Revit.DB.MeshFromGeometryOperationResult.GetIssues
source: html/0a0dded2-d7d7-9d7e-424d-ffb09051a690.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationResult.GetIssues Method

Returns the array of issues encountered while building a mesh.

## Syntax (C#)
```csharp
public IList<MeshFromGeometryOperationIssue> GetIssues()
```

## Returns
Array of issues encountered while building a mesh.